Repository: pyconsk/2018.pycon.sk
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: sk

source: PyCon will be back at Slovakia in 2018 again. PyCon SK is a community-organized conference for the Python programming language.
sk: PyCon bude v roku 2018 opäť na Slovensku. PyCon SK je komunitou organizovaná konferencia zameraná na programovací jazyk Python.

source: Slovak Republic
sk: Slovenská republika

source: Talk
sk: Prednáška

source: Machine Learning / AI
sk: Umelá inteligencia

source: Community / Diversity / Social
sk: Komunita / Rôznorodosť / Spoločnosť

source: Data Science
sk: Dáta

source: Documentation
sk: Dokumentácia

source: Education
sk: Vzdelávanie

source: Python General
sk: Python všeobecne

source: Security
sk: Bezpečnosť

source: Soft Skills
sk: Osobnostné Zručnosti

source: Hardware
sk: Hardvér

source: Web Development
sk: Vývoj webu

source: Other
sk: Iné

source: Conference Opening
sk: Otvorenie Konferencie

source: When your wetware has too many threads - Tips from an ADHDer on how to improve your focus
sk: Keď váš mozog má príliš veľa threadov - tipy od ADHD ako zvýšiť koncentráciu

source: Docs or it didn't happen
sk: Dokumentácia alebo to neexistuje

source: GraphQL is the new black
sk: GraphQL je nová čierna

source: To the Google in 80 Days
sk: Do Googlu za 80 dní

source: Unsafe at Any Speed
sk: V nebezpečí pri akejkoľvek rýchlosti

source: Protecting Privacy and Security — For Yourself and Your Community
sk: Ochrana súkromia a bezpečnosť - pre teba a tvoju komunitu

source: ZODB: The Graph database for Python Developers.
sk: ZODB: grafová databáza pre vývojárov v Pythone.

source: Differentiable programming in Python and Gluon for (not only medical) image analysis
sk: Diferencovateľné programovanie v Pythone a Gluone na analýzy (nielen medicínskych) obrázkov

source: Vim your Python, Python your Vim
sk: Vim pre Python, Python vo Vim-e

source: Quiz
sk: Kvíz

source: Lightning Talks
sk: Bleskové talky

source: Conference Opening in Kiwi.com Hall
sk: Otvorenie konferencie v Kiwi.com miestnosti

source: Python Days in Martin and follow-up activities
sk: Konferencia Python Days v Martine a následné aktivity

source: Python programming till graduation
sk: Programujeme v Pythone až k maturite

source: Open educational resources for learning Python
sk: Otvorené vzdelávacie zdroje pre štúdium jazyka Python

source: About Ninjas and Mentors: CoderDojo in Slovakia
sk: O nindžoch a mentoroch: CoderDojo na Slovensku

source: Community based courses
sk: Komunitní kurzy

source: How do we struggle with Python in Martin?
sk: Ako sa pasujeme s Pythonom v Martine?

source: Why hardware attracts kids and adults to IT
sk: Prečo hardvér priťahuje k informatike žiakov i dospelých

source: EDU Talks
sk: EDU Prednášky

source: Panel discussion: Teaching IT in Slovakia - where is it heading?
sk: Panelová diskusia: Kam smeruje vyučovanie informatiky na Slovensku?

source: How to create interactive maps in Python / R
sk: Ako vytvárať interaktívne mapy v Python / R

source: Working with XML
sk: Práce s XML

source: Managing high-available applications in production
sk: Spravovanie vysoko-dostupných aplikácii v produkcii

source: Workshop: An Introduction to Ansible
sk: Základy Ansible Workshop

source: Introduction to Machine Learning with Python
sk: Úvod do strojového učenia v Pythone

source: Solutions Reviews
sk: Ukážky riešení

source: Campaign Automation & Abusing Celery Properly
sk: Automatizácia kampaní a ako správne zneužiť Celery

source: The Truth about Mastering Big Data
sk: Pravda o ovládaní Big Data

source: Industrial Machine Learning: Building scalable distributed machine learning pipelines with Python
sk: Priemyselné strojové učenie: Vytvorenie škálovateľných distribuovaných postupov strojového učenia s Pythonom

source: Pythonic code, by example
sk: Ukážka Pythonského kódu

source: Our DevOps journey, is SRE the next stop?
sk: Je SRE ďalšou zástavkou na našej DevOps ceste?

source: Implementing distributed systems with Consul
sk: Consul: Implementácia distribuovaných systémov

source: Designing fast and scalable Python MicroServices with django
sk: Dizajnovanie rýchlych a škálovateľných pythonských mikroslužieb v djangu

source: FaaS and Furious - Zero to Serverless in 60 seconds - Anywhere
sk: Faas: rýchlo a zbesilo - od nuly do bezserverovej prevádzky za 60 sekúnd - kdekoľvek

source: Programming Python as performance: live coding with FoxDot
sk: Programovanie v Pythone ako performance: živé kódenie s FoxDotom

source: The GAME!
sk: HRA!

source: LOCKED SHIELDS: What a good cyber testing looks like
sk: LOCKED SHIELDS - ako má vyzerať dobre urobené kybertestovanie

source: Kiwi.com in ZOO
sk: Kiwi.com v ZOO

source: Keynote in Kiwi.com Hall
sk: Hlavná prednáška v aule Kiwi.com

source: Skynet your Infrastructure with QUADS
sk: Premeňte svoju infraštruktúru na Skynet pomocou systému QUADS

source: Automated network OS testing
sk: Automatizované testovanie sieťového operačného systému

source: Tools to interact with Bitcoin and Ethereum
sk: Nástroje na interakciu s Bitcoinom a Ethereom

source: 7 Steps to a Clean Issue Tracker
sk: 7 krokov k čistému issue trackeru

source: The Concierge Paradigm
sk: Majordómova paradigma

source: Effectively running python applications in Kubernetes/OpenShift
sk: Efektívna prevádzka pythonských aplikácií v Kubernetes/OpenShift

source: Microbit:Slovakia
sk: Microbit:Slovensko

source: Coding in Python: A high-school programming lesson
sk: Programujeme v Pythone – učíme seminár z programovania na strednej škole

source: Charon and the way out from a pickle hell
sk: Charon a cesta z pickle pekla

source: Making Python Behave
sk: Výchova Pythonu

source: "Secret" information in code you write
sk: "Utajené" informácie o kóde ktorý píšeš

source: How to connect objects with each other in different situations with Pythonic ways - association, aggregation, composition and etc.
sk: Ako vzájomne spájať objekty Pythonsky - asociácie, agregácie, kompozície atď.

source: APIs: Gateway to world's data
sk: API: Brána do sveta dát

source: Getting started with HDF5 and PyTables
sk: Začíname s HDF5 a PyTables

source: Real-time personalized recommendations using embeddings
sk: Personalizované odporúčania v reálnom čase pomocou embeddingu

source: Real-time transcription and sentiment analysis of audio streams; on the phone and in the browser
sk: Prepis a analýza sentimentu z audio streamov v reálnom čase, v telefóne a v browseri

source: Learn MongoDB by modeling PyPI in a document database
sk: Nauč sa MongoDB modelovaním PyPI v dokumentovej databáze

source: Testing Essentials for Scientists and Engineers
sk: Základy testovania pre vedcov a inžinierov

source: Cython: Speed up your code without going insane
sk: Cython: zrýchli svoj kód a nezblázni sa

source: Meet the pandas
sk: Zoznámte sa s pandami

source: Basics of OpenFaaS with Python
sk: Základy OpenFaas v Pythone

source: Kiwi.com Hall
sk: Miestnosť Kiwi.com

source: Python Software Foundation Hall
sk: Miestnosť Python Software Foundation

source: SPy - Hall A
sk: Spy - Aula A

source: SPy - Hall B
sk: SPy - Aula B

source: Django Girls Auditorium
sk: Miestnosť Django Girls

source: Break
sk: Prestávka

source: Lunch 🍱
sk: Obed 🍱

source: Coffee Break ☕
sk: Prestávka na kávu ☕

source: Official PyCon SK 2018 website
sk: Oficiálna stránka PyCon SK 2018

source: PyCon SK is a community-organized conference for the Python programming language, which will be held in Bratislava on March, 2018.
sk: PyCon SK je komunitou organizovaná konferencia pre programovací jazyk Python, ktorá sa bude konať v Bratislave v marci 2018.

source: Venue
sk: Miesto konania

source: Hall of Fame
sk: Sieň Slávy

source: Tickets
sk: Vstupenky

source: Schedule
sk: Program

source: Friday
sk: Piatok

source: Saturday
sk: Sobota

source: Sunday
sk: Nedeľa

source: Talks
sk: Prednášky

source: Speakers
sk: Rečníci

source: Code of Conduct
sk: Kódex správania

source: About Us
sk: O nás

source: %(pycontm)s is a trademark for worldwide conference activities claimed by the %(psf)s.
sk: %(pycontm)s je ochranná známka %(psf)s pre celosvetové konferenčné aktivity.

source: PyCon SK is organized by volunteers from %(spy)s.
sk: PyCon SK je organizovaný dobrovoľníkmi z %(spy)s.

source: Found a bug? Missing some information? This is community managed website, contribute at our %(github)s.
sk: Našli ste chybu? Chýba Vám nejaká informácia? Toto je komunitou manažovaná webstránka, prispejte na našom %(github)se.

source: Please disable ad blocker and refresh. You can support us by temporarily mining Monero.
sk: Prosím vypnite si blokovač reklamy. Môžete nás podporiť dočasnou ťažbou Monera.

source: You can support us by mining Monero while browsing this site.
sk: Môžete nás podporiť ťažbou Monera počas prehliadania tejto stránky.

source: Start mining!
sk: Zapni ťaženie!

source: Stop mining!
sk: Zastav ťaženie!

source: Total
sk: Celkovo

source: Talk Abstract
sk: Abstrakt prednášky

source: Talk title
sk: Názov prednášky

source: Abstract
sk: Abstrakt

source: Will you make a talk or workshop?
sk: Chcete urobiť prezentáciu alebo workshop?

source: Which category suits your talk / workshop best?
sk: Ktorá kategória sa najlepšie hodí na Vašu prezentaciu / workshop?

source: Which language will you present in?
sk: V akom jazyku budete prezentovať?

source: Slovak
sk: Slovensky

source: Czech
sk: Česky

source: English
sk: Anglicky

source: What is your ideal time slot?
sk: Aký je Váš ideálny časový slot?

source: Continue
sk: Pokračovať

source: Cancel
sk: Zrušiť

source: Speaker Biography
sk: Životopis prednášateľa

source: What is your title?
sk: Aký je Váš titul?

source: Mr.
sk: Pán

source: Ms.
sk: Pani

source: Mx.
sk: Neurčené

source: First name
sk: Krstné meno

source: Last name
sk: Priezvisko

source: Phone
sk: Telefón

source: Tell us about your self? This will be your public biography...
sk: Povedzte nám niečo o sebe? Toto bude Váš verejny profil...

source: Social Url
sk: Url na socialnu sieť

source: Which country are you from?
sk: Z ktorej krajiny pochádzate?

source: Avatar
sk: Ikona

source: Submit
sk: Odoslať

source: Call for proposals
sk: Výzva na predloženie návrhov na prednášky

source: The Call For Proposals is closed!
sk: Podávanie návrhov na prednášky je uzavreté!

source: PyCon is organized by the Python community and for the Python community. You're coming to the event, and that makes you part of the community. If you've done something that you think other people might be interested in, or that you think they should know about, please do consider telling us about it. We don't just want to hear from the experts or famous names - other perspectives are just as valuable, so don't let the idea that you're not expert or famous enough stop you. This is your invitation to submit talk proposal if you haven't speak at the conference before. First-time speakers talk proposals are preferred.
sk: PyCon organizuje Python komunita pre komunitu. Ak idete na túto konferenciu, stávate sa súčasťou tejto komunity. Pokiaľ ste spravili niečo, čo by mohlo zaujímať aj iných, alebo si myslíte, že ostatní by o tom mali vedieť, príďte nám o tom spraviť prednášku. Nechceme počúvať iba expertov a známe osobnosti - aj noví perspektívni rečníci sú tiež zaujímaví, preto sa, prosím, nenechajte odradiť pocitom, že nie ste expert alebo známa osobnosť. Toto je naša pozvánka, aby ste poslali návrh na prednášku, aj ak ste ešte nikdy na konferencií neprednášali. Rečníci vystupujúci prvýkrát budú uprednostňovaní.

source: Where to submit your proposal
sk: Kam poslať Váš návrh na prednášku

source: We are glad you are interested in giving a talk at PyCon SK 2018! Submit your talk proposal with short abstract and your bio.
sk: Sme radi, že máte záujem prednášať na PyCon SK 2018! Pošlite nám Váš návrh aj so stručným obsahom a životopisom.

source: All selected speakers get complimentary ticket to the conference.
sk: Všetci rečníci majú vstup na konferenciu zadarmo.

source: Talk proposals has ended!
sk: Termín podávania návrhov na prednášky vypršal!

source: The deadline for submissions was the end of 21th January 2018. However, if you believe you have something interesting to say, please contact us via email: info@pycon.sk
sk: 21. januára sme ukončili možnosť prihlásiť si prednášku. Ak si myslíte, že máte čo povedať, kontaktujte nás emailom: info@pycon.sk

source: Guidelines for Proposal Submission
sk: Pokyny pre podávanie návrhov

source: There is no official restriction on the topic that you propose for a talk session. Talks about Python or the Python community are most likely to line up with the interests of PyCon's audience, and a key consideration that the talk selection committee will be thinking about is your talk's ability to draw an audience. You may propose more than one, but the committee will ask you to choose only one talk if more than one of your proposals is accepted.
sk: Nie je žiadne oficiálne obmedzenie tém, ktoré môžete navrhnúť ako svoju prednášku. Prednášky o Pythone alebo komunite budú s vysokou pravdepodobnosťou zaujímavé pre publikum. Hlavným kritériom, ktoré bude komisia pri výbere prednášok zvažovať, je to, ako Vaša prednáška zaujme publikum. Je stanovený limit na jednu prednášku pre rečníka. Navrhnúť môžete viac ako jednu, komisia Vás však vyzve, aby ste vybrali iba jednu prednášku (v prípade, že bude akceptovaných viac návrhov).

source: Most talks are 30 minutes long, but we do offer a limited number of 45-minute slots for important topics that promise to benefit from a more extensive treatment.
sk: Väčšina prednášok má dĺžku 30 minút, ale ponúkame aj 45 minútový vstup pre zaujímavé témy, ktoré budú vyžadovať dlhší vstup.

source: Workshops
sk: Workshopy

source: As with the talks, we are looking for tutorials that can grow this community at any level! We aim for tutorials that will advance Python, advance this community, and shape the future. As tutorials are longer than talks and are in an interactive classroom-like setting, they require much more preparation.
sk: Tak ako na prednášky, tešíme sa aj na tutoriály, ktoré budú vhodné pre komunitu na akejkoľvek úrovni! Prostredníctvom takýchto výukových programov sa snažíme zveľaďovať Python komunitu a formovať budúcnosť. Vzhľadom na to, že návody trvajú dlhšie a budú v menších miestnostiach, vyžadujú oveľa viac prípravy.

source: The Python community is made up of members from around the globe with a diverse set of skills, personalities, and experiences. It is through these differences that our community experiences great successes and continued growth. When you're working with members of the community, we encourage you to follow these guidelines which help steer our interactions and strive to keep Python a positive, successful, and growing community.
sk: Python komunitu tvoria ľudia z celého sveta s rôznorodým súborom zručností, osobností a skúseností. Tieto rozdiely prispievajú k tomu, že naša komunita prežíva veľké úspechy a pokračuje v raste. Keď pracujete s členmi komunity, odporúčame vám dodržiavať tieto pokyny, ktoré pomáhajú riadiť váš styk s ostatnými a snažiť sa udržať Python komunitu pozitívnu, úspešnú a rastúcu.

source: A member of the Python community is:
sk: Člen Python komunity je:

source: Open
sk: Otvorený

source: Members of the community are open to collaboration, whether it's on PEPs, patches, problems, or otherwise. We're receptive to constructive comments and criticism, as the experiences and skill sets of other members contribute to the whole of our efforts. We're accepting of all who wish to take part in our activities, fostering an environment where anyone can participate and everyone can make a difference.
sk: Členovia komunity sú otvorení k spolupráci, či už ide priamo o vývoj samotného Pythonu, štandardnej knižnice, dokumentácie, PEPov, vývoj iných Python projektov, iných open source projektov, riešenie spoločensko prospešných problémov, alebo o prácu na iných spriatelených projektoch. Sme vnímaví ku komentárom a konštruktívnej kritike, pretože skúsenosti a zručnosti ostatných členov prispievajú k celému nášmu úsiliu. Prijímame všetkých, ktorí sa chcú zúčastniť našich aktivít, podporujeme prostredie, kde sa môže ktokoľvek podieľať a každý ho môže zlepšiť.

source: Considerate
sk: Ohľaduplný

source: Members of the community are considerate of their peers -- other Python users. We're thoughtful when addressing the efforts of others, keeping in mind that often times the labor was completed simply for the good of the community. We're attentive in our communications, whether in person or online, and we're tactful when approaching differing views.
sk: Členovia komunity sú ohľaduplní voči ostatným používateľom Pythonu. Rešpektujeme úsilie druhých, pričom máme na pamäti, že častokrát ich práca bola venovaná len pre dobro komunity. Sme všímaví v našich vyjadreniach, či už osobne alebo on-line a sme taktní, keď príde na rozdielne názory.

source: Respectful
sk: Úctivý

source: Members of the community are respectful. We're respectful of others, their positions, their skills, their commitments, and their efforts. We're respectful of the volunteer efforts that permeate the Python community. We're respectful of the processes set forth in the community, and we work within them. When we disagree, we are courteous in raising our issues.
sk: Členovia komunity sú úctiví. Rešpektujeme ostatných, ich pozíciu, ich zručnosti, ich záväzky a ich úsilie. Rešpektujeme dobrovoľné úsilie, ktoré venujú Python komunite. Rešpektujeme postupy stanovené v komunite a využívame ich pri práci. Keď nesúhlasíme, sme zdvorilí pri adresovaní našich problémov.

source: Overall, we're good to each other. We contribute to this community not because we have to, but because we want to. If we remember that, these guidelines will come naturally.
sk: Celkovo sme dobrí k sebe navzájom. Prispievame k tejto komunite nie preto, že musíme, ale preto, že chceme. Ak si to uvedomíme, tak nám tieto pokyny prídu prirodzené.

source: Slovak Python Community
sk: Slovenská Python komunita

source: PyCon SK and Python Meetup fully identify with the Code of Conduct of the Python community. We create an environment, which is open to everyone, independently of sex, sexual orientation, race, education or religion. All communication should be respectful and on professional level. We will be tolerant to each other.
sk: PyCon SK aj Python stretnutia sa plne stotožňujú s kódexom správania členov Python komunity. Prinášame prostredie, ktoré je otvorené pre všetkých, nezávisle na pohlaví, sexuálnej orientácii, postihnutí, fyzickom vzhľade, veľkosti, rase, vzdelaní či vierovyznaní. Každá komunikácia by mala byť úctivá a na profesionálnej úrovni. Buďme k sebe navzájom tolerantní.

source: We do not offend, vilify other members. We behave professionally. Harassment, sexist, racist or otherwise demeaning jokes are improper at our meetings. We will not tolerate any harassment of participants of meetups in any form.
sk: Neurážame, ani nezhadzujeme iných účastníkov. Správame sa profesionálne. Obťažovanie, sexistické, rasistické, alebo inak vyraďujúce vtipy sú nevhodné na našom stretnutí. Nebudeme tolerovať obťažovanie účastníkov stretnutia v akejkoľvek forme.

source: Sponsors
sk: Sponzori

source: We thank all the sponsors, without whom it would not be possible to organize this amazing conference.
sk: Ďakujeme všetkým sponzorom, bez ktorých by nebolo možné zorganizovať túto úžasnú konferenciu.

source: Why become a sponsor?
sk: Prečo sa stať sponzorom?

source: Diamond
sk: Diamant

source: Kiwi.com is an online travel agency with groundbreaking Virtual Interlining technology and a focus on exceptional customer service. Our unique combination algorithm allows our customers to combine flights from non-cooperating airlines onto a single itinerary, often resulting in significant savings.
sk: Kiwi.com je online cestovná agentúra s prelomovou technológiou Virtual Interlining a zameraním sa na výnimočné služby zákazníkom. Náš kombinačný algoritmus umožňuje zákazníkom kombinovať lety aj s nespolupracujúcimi linkami do jedného itineráru, čo často vedie k významnému šetreniu nákladov.

source: Platinum
sk: Platina

source: The Exponea platform empowers e-sellers on 5 continents to be relevant to their customers. Our international team of 140+ professionals relies on a strong back-end team armed with Python, C++ and Go, Apache Kafka, MongoDB, Redis, ElasticSearch, Flask, RabbitMQ, Celery and other technologies like Docker, Kubernetes, gRPC, Sentry, Hadoop, and Apache Spark to help our clients collect, analyze, and act upon customer interactions. And yes, we're hiring.
sk: Platforma Exponea pomáha e-predajcom na 5 kontinentoch byť relevantnými pre svojich zákazníkov. Náš medzinárodný tím viac ako 140 profesionálov sa spolieha na silný backend tím vybavený nástrojmi ako Python, C++ a Go, Apache Kafka, MongoDB, Redis, ElasticSearch, Flask, RabbitMQ, Celery a ďalšími technológiami ako sú Docker, Kubernetes, gRPC, Sentry, Hadoop, a Apache Spark, vďaka ktorým pomáhajme našim klientom zbierať, analyzovať a reagovať na základe zákazníckych interakcií. A áno, prijímame nových členov tímu.

source: The Python Software Foundation is a 501(c)(3) nonprofit dedicated to advancing and promoting Python. The PSF supports and encourages Python events world-wide to advance its mission of growing the international community of Python programmers, and hosts the North American PyCon conference as its flagship annual event.
sk: The Python Software Foundation - Nadácia Python Softvéru je nezisková organizácia zameraná na podporu a rozvoj jazyka Python. PSF podpruje a povzbudzuje Python eventy na celom svete, aby tak dosiahla svoj cieľ rozširovania medzinárodnej komunity Python programátorov, zároveň je tiež organizátorom svojej vlajkovej lode - kažodoročnej severoamerickej PyCon konferencie.

source: Gold
sk: Zlato

source: The Kistler Group is a Swiss high-tech company and the global market leader in dynamic measurement technology. We develop and supply sensors, electronics and software backed up by a full range of services. In Bratislava we develop software for the next generation of IoT devices. With our software we help customer to manufacture higher quality products, to develop cleaner cars and to reduce congestions on the highways. Behind our success stand our passion for technology, our focus on innovation and a work environment that promotes teamwork. We develop vehicles that people can trust; we create measurement systems that save lives. Kistler helps to shape a better future.
sk: The Kistler Group je Švajčiarska technologická spoločnosť a globálny líder v technológii dynamických meraní. Vyvíjame a vyrábame senzory, elektroniku a softvér, ktoré podporujeme širokým spektrom služieb. V Bratislave vyvíjame softvér pre ďalšie generácie IoT zariadení. S naším softvérom pomáhame zákazníkom vyrábať produkty s vyššou kvalitou, vyvíjať čistejšie autá a zlepšovať dopravu. Za naším úspechom je nadšenie pre technológie, zameranie na inovácie a pracovné prostredie, ktoré podporuje spoluprácu a tímovú hru. Vyvíjame vozidlá, ktorým ľudia môžu veriť, vytvárame meracie systémy, ktoré zachraňujú životy. Kistler pomáha budovať lepšiu budúcnosť.
