Repository: pyconsk/2018.pycon.sk
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: sk

source: Red Hat is the world's leading provider of open source software solutions, using a community-powered approach to reliable and high-performing cloud, Linux, middleware, storage, and virtualization technologies. As a connective hub in a global network of enterprises, partners, and open source communities, Red Hat helps create innovative technologies that liberate resources for growth and prepare customers for the future of IT.
sk: Red Hat je svetový líder vo vývoji slobodného a otvoreného softvéru, ktorý kladie dôraz komunitný prístup k spoľahlivému a výkonnému cloudu, Linuxu, middleware, storage a virtualizačným technológiám. V globálnej sieti firiem, partnerov a open-source komunít pomáha vytvárať inovatívne technológie, ktoré tvoria základy ďalšieho rasti a pripravuje svojich zákazníkov na budúcnosť IT.

source: Since 1987, ESET has been developing award-winning security software that now helps over 100 million users to Enjoy Safer Technology. Its broad security product portfolio covers all popular platforms and provides businesses and consumers around the world with the perfect balance of performance and proactive protection. The company has a global sales network covering 180 countries, and regional offices in Bratislava, San Diego, Singapore and Buenos Aires.
sk: Už od roku 1987 ESET vyvíja oceňovaný bezpečnostný softvé, ktorý dnes pomáha viac ako 100 miliónom užívateľov používať bezpečnejšie technológie. Široké bezpečnostné portfolio pokrýva všetky populárne platformy a poskytuje firmám i ľuďom dokonalú rovnováhu výkonu a proaktívnej ochrany. Spoločnosť má globálnu predajnú sieť v 180 krajinách a regionálne prevádzky v Bratislave, San Diegu, Singapure a v Buenos Aires.

source: Solargis is leading in advanced solar information technologies by developing new generation global solar and meteorological data and software that help solar power plants to become cheap and reliable source of energy. Today, the Solargis platform is used by more than thousand companies including world's largest energy enterprises and finance institutions such as The World Bank.
sk: Solargis je technologický a konzultačný líder v oblasti merania a hodnotenia slnečného žiarenia pre potreby výroby slnečnej elektrickej energie. Je tvorcom solárnych a meteorologických dát novej generácie, ktoré pomáhajú pretvárať slnečné elektrárne na lacné a spoľahlivé zdroje energie. Platformu Solargis dnes používa viac ako tisícka spoločností na celom svete, medzi nimi aj najväčšie energetické konglomeráty a finančné inštitúcie, vrátane Svetovej banky.

source: Silver
sk: Striebro

source: GitMate is an automated issue triager. Based on machine learning algorithms GitMate labels issues, notifies relevant developers, identifies duplicates and maintains old issues. This reduces developers’ time spent on managing issues by at least 50%%.
sk: GitMate automatizuje správu projektov. Pomocou algoritmov založených na machine learning GitMate označuje vzniknuté issues, vytvára notifikácie pre relevantných developerov a identifikuje duplicitné issues. Výsledkom je zníženie času, ktorý developeri strávia pri správa issues, o viac ako 50 %%.

source: BBI International is consulting company bridging the knowledge between business and IT. Our ultimate goal and burning desire is to achieve the extraordinary level of performance for our customers from the sectors of banking, insurance, automotive and telecommunication in Central European countries. Our most valuable competences are Applications Development, dInternet of Things (IoT), Data Warehousing (DWH) a Collaboration Management.
sk: BBI International je konzultačná spoločnosť, ktorá prepája biznis a IT. Naším poslaním je dosahovať výnimočný výkon klientov z rôznych odvetví - od bankovníctva cez poisťovníctvo, automotive až po sektor telekomunikácií v krajinách strednej a východnej Európy. Našimi silnými stránkami je vývoj aplikácií (Applications Development), internet "vecí" (IoT) a Collaboration Management.

source: Slush Pool is the world's first Bitcoin mining pool, which mined over one million bitcoins since its foundation in 2010. With back-end based mostly on Python technologies, Slush Pool helps to secure the Bitcoin network as well as stabilize miners' revenue.
sk: Slush Pool je prvý bitcoinový ťažobný pool na svete, ktorý od svojho založenia v roku 2010 vyťažil viac ako milión bitcoinov. Jeho back-end je využíva dominantne Python. Slush Pool pomáha zvyšovať bezpečnosť bitcoinovej siete a stabilizovať výnosy tzv. minerov.

source: Django Girls Workshop
sk: Workshop Django Girls

source: Kjamistan provides data science and machine learning consulting; helping tackle topics like data science testing, natural language processing, workflow automation architectures, security in machine learning deployment, and interpretable machine learning models and architecture.
sk: Kjamistan je konzultačnou spoločnosťou v oblasti Data Science a Machine Learning (ML), je aktivna najmä v oblasti Data Science Testing, Natural Language Processing (NLP), automatizácii workflow, bezpečnosti pri nasadzovaní ML a tvorbe ML modelov a architektúry.

source: Partners
sk: Partneri

source: JetBrains delivers intelligent software solutions that make developers more productive by simplifying their challenging tasks, automating the routine, and helping them adopt the best development practices. PyCharm is the Python IDE for Professional Developers by JetBrains providing a complete set of tools for productive Python, Web and Scientific development, available in two editions. The free and open-source PyCharm Community Edition is perfect for pure Python coding. PyCharm Professional Edition is designed for professional Python, Web, and Data analysis developers.
sk: JetBrains je tvorcom inteligentných softvérových riešení, ktoré pomáhajú developerom pracovať efektívnejšie zjednodušovaním náročnejších úloh, automatizáciou často opakovaných rutín a sú nápomocné pri aplikácii najlepších developerských postupov. PyCharm predstavuje Python IDE (interaktívne vývojové prostredie) pre profesionálnych developerov využívajúcich Python v rôznych oblastiach, vrátane vývoja webových a vedeckých aplikácií. Je dostupné v dvoch edíciách. Bezplatná a open-source verzia PyCharm Community Edition je ideálnym riešením pre tvorbu softvéru v Pythone. PyCharm Professional Edition je určený profesionálnym developerom zo všetkých oblastí.

source: Slido is a technology company that enhances communication and increases interaction at events and meetings. Having worked on over 85,000 events, we helped to engage millions of participants. We are proud to work with renowned conferences such as SXSW, World Economic Forum, Money20/20 and high-profile clients including Adobe, Spotify, Lufthansa, BBC and Oracle.
sk: Slido je technologická spoločnosť, ktorá zlepšuje komunikáciu a zvyšuje interaktivitu medzi účastníkmi rôznych podujatí a konferencií. Máme za sebou už viac ako 85 000 eventov, na ktorých sme do komunikácie zapojili milióny ľudí. Sme hrdí na to, že sme sa stali súčasťou renomovaných konferencií ako napríklad SXSW, Svetové ekonomické fórum, Money20/20 a našimi klientmi sú globálni hráči, vrátane Adobe, Spotify, Lufthansa, BBC alebo Oracle.

source: Learn2Code teaches people how to design and code modern websites and application. Learn2Code is the largest online learning marketplace in Slovakia.
sk: Learn2Code učí ľudí tvoriť a kódovať moderné webové stránky a aplikácie. Je najväčším providerom online kurzov na Slovensku.

source: Fakulta informatiky a informačných technológií STU v Bratislave
sk: Faculty of Informatics and Information Technologies of STU, Bratislava

source: Faculty of Informatics and Information Technologies (FIIT) is one of the seven faculties of the Slovak University of Technology in Bratislava (SUT). FIIT SUT covers the very area of informatics and information technologies (IIT) in both research and education. FIIT is the first faculty in the Slovak Republic with such mission.
sk: Fakulta informatiky a informačných technológií (FIIT) je jednou zo siedmich fakúlt Slovenskej technickej univerzity v Bratislave (STU). FIIT STU pokrýva komplexne oblasť informatiky a informačných technológií (IIT) vo výskume a vzdelávaní. Je prvou fakultou na Slovensku s takýmto poslaním.

source: Media Partners
sk: Mediálni partneri

source: People that participate volunteering at PyCon SK 2018.
sk: Ľudia, ktorí pomáhajú ako dobrovoľníci na PyCon SK 2018.

source: PyCon SK is an international conference organized by the community of enthusiasts and supporters of the Python programming language.
sk: PyCon SK je medzinárodná konferencia organizovaná komunitou nadšencov a podporovateľov programovacieho jazyka Python.

source: It is designed for anyone who works professionally and also for anyone who is learning this programming language.
sk: Je určená každému, kto s týmto programovacím jazykom pracuje profesionálne, alebo sa s ním ešte len zoznamuje.

source: News
sk: Novinky

source: PyCon SK 2018 is sold out!
sk: PyCon SK 2018 je vypredaná!

source: We are happy to announce that PyCon SK 2018 conference is sold out. Thank you!
sk: S radosťou oznamujeme, že konferencia PyCon SK 2018 je vypredaná. Ďakujeme!

source: Calendar with conference schedule.
sk: Kalendár s programom konferencie.

source: Conference schedule has been published.
sk: Zverejnili sme program konferencie.

source: Speakers and talks list has been published.
sk: Rečníci a prednášky boli zverejnené.

source: Call for proposals has ended.
sk: Podávanie návrhov na prednášky je uzavreté.

source: We have received almost 100 high quality talks and workshops proposals! It will take some time to go through all of them so please be patient. We have started to publishing some of the <a href="%(url)s">speakers</a> on our website.
sk: Obdržali sme takmer 100 návrhov na prednášky a workshopy! Zaberie nám chvíľu, kým ich prejdeme všetky, tak Vás prosíme o trpezlivosť. Začali sme publikovať niektorých <a href="%(url)s">rečníkov</a> na našom webe.

source: PyCon SK 2018 under the patronage of the president of the Slovak Republic.
sk: PyCon SK 2018 pod záštitou prezidenta Slovenskej republiky.

source: We are excited that for the third time in the row, PyConSK will be held under the auspices of the president of the Slovak Republic. We are committed to bring you another conference of excellent quality which will represent the Slovak Republic in dignity before audiences from all over Europe and the rest of the world.
sk: Tešíme sa, že už po tretíkrát sa bude PyCon SK konať pod záštitou prezidenta SR. Predstavuje to pre nás záväzok priniesť vám opäť konferenciu špičkovej úrovne, ktorá bude dôstojne reprezentovať SR pred publikom z celej Európy a aj zvyšku sveta.

source: Download PyCon SK 2018 Conference <a href="%(url)s">press release</a>.
sk: Uložte si <a href="%(url)s">tlačovú správu</a> konferencie PyCon SK 2018.

source: We are preparing a section for Informatics Teachers to be held during the PyCon SK Conference.
sk: Pripravujeme sekciu pre učiteľov informatiky, ktorá sa uskutoční počas konferencie PyCon SK.

source: The aim of this section is to teach teachers the benefits and possibilities of using Python in teaching. We invite teachers who are teaching Python to share their experiences with conference attendees and <a href="%(url)s">submit a talk proposal</a>.
sk: Cieľ tejto sekcie je ukázať učiteľom výhody a možnosti jezyka Python pri výuke. Pozývame učiteľov, ktorí úž učia Python, aby zdeľali svoje skúsenosti s účastníkmi konferencie a <a href="%(url)s">prihlásili si prednášku</a>.

source: We are pleased to announce a DevOps track at PyCon SK 2018.
sk: S potešením oznamujeme, že súčasťou PyCon SK 2018 bude aj DevOps track.

source: DevOps (a portmanteau of "development" and "operations") is a software engineering practice that aims to unify software development (Dev) and software operation (Ops). The main emphasis of the DevOps movement is to strongly advocate for automation and monitoring at all steps of software production, from integration, testing, releasing to deployment and infrastructure management.
sk: DevOps (spojenie anglických slov "vývoj" a "operácie") je softvérová inžinierska prax, ktorá sa zameriava na zjednotenie vývoja softvéru (Dev) a správu operačného systému (Ops). Hlavnou charakteristikou hnutia DevOps je dôraz na automatizáciu a monitorovanie na všetkých stupňoch tvorby softvéru od integrácie, testovania, uvoľňovania až po nasadenie a správu infraštruktúry.

source: If you think you have something to say on this topic, you are most welcome to <a href="%(url)s">submit your CfP</a>. We hope to get the error budget right and to see developers and admins working towards the same goals.
sk: Ak máte čo povedať na túto tému, ste vítaní <a href="%(url)s">prihlásiť návrh na prednášku</a>. Dúfame, že nastavíme "error budget" správne a uvidíme vývojárov a administrátorov spolupracovať na spoločných cieľoch.

source: References
sk: Referencie

source: Previous years got media coverage, if you would like to know how was the conference check out our references:
sk: Minulé ročníky mali aj pokrytie v médiach, ak máte záujem zistiť ako bolo na konferencii, pozrite si naše referencie:

source: Here are links to articles that were written by attendees about last two PyCon SK's:
sk: Tu sú odkazy na články napísané našimi návštevníkmi z posledných dvoch ročníkov PyCon SK:

source: If you wrote an article or a blog post, do not hesitate to let us know at info@pycon.sk or create a pull request.
sk: Ak ste napísali článok, alebo blog, neváhajte nám napísať na info@pycon.sk alebo vytvorte "pull request".

source: Did you find a mistake on our site? Do you want to know more? Let us know.
sk: Našli ste na našich stránkach chybu? Chcete vedieť viac? Dajte nám vedieť.

source: Join our %(github)s and enrich the Python programming language community.
sk: Ak máte chuť, prispejte na našom %(github)se a pridajte sa tak ku komunite priaznivcov jazyka Python.

source: English flag
sk: Anglická zástava

source: Presentation will be in English language.
sk: Prezentácia bude v anglickom jazyku.

source: Slovak flag
sk: Slovenská zástava

source: Presentation will be in Slovak language
sk: Prezentácia bude v slovenskom jazyku.

source: Czech flag
sk: Česká zástava

source: Presentation will be in Czech language
sk: Prezentácia bude v Českom jazyku.

source: PyCon SK 2018 Schedule
sk: Program PyCon SK 2018

source: Conference schedule might change.
sk: Program konferencie sa môže zmeniť.

source: All
sk: Všetko

source: We need you — PyCon SK 2018 in Bratislava seeks for sponsors and partners!
sk: Potrebujeme vás — PyCon SK 2018 v Bratislave hľadá sponzorov a partnerov!

source: PyCon is annual gathering for the community using and developing the open-source Python programming language. The conference is completely organized by volunteers.
sk: PyCon je každoročné stretnutie komunity ľudí, ktorí používajú alebo vyvíjajú open source programovací jazyk Python. Konferencia je kompletne organizovaná dobrovoľníkmi.

source: The members of the Python community organize a PyCon conference in their home countries regularly, PyCon will happen in Slovakia for the third time.
sk: Členovia Python komunity organizujú PyCon konferencie vo svojich domovských krajinách pravidelne. PyCon bude na Slovensku už po tretí raz.

source: To ensure high-quality speakers and keep the tickets price available for everyone we need you, the sponsors, who allow the conference take place.
sk: Aby sme mohli zabezpečiť kvalitných prednášajúcich a pritom udržať cenu vstupeniek dostupnú pre každého, potrebujeme vás, sponzorov, ktorí umožnia túto konferenciu uskutočniť.

source: Do not hesitate to contact us. We are flexible and willing to work with you to design a sponsorship package that is going to meet your business needs.
sk: Neváhajte nás kedykoľvek kontaktovať. Sme flexibilní a ochotní spolupracovať a navrhnúť s vami balíček sponzorstva, ktorý splní vaše obchodné potreby.

source: Looking for new users for your product? Such people can be found at PyCon - they also will look for new products and ideas.
sk: Hľadáte nových používateľov pre váš produkt? Takých ľudí nájdete na PyCone - aj oni budú hľadať nové produkty a nápady.

source: Recruitment
sk: Nábor

source: Are you looking for programmers? PyCon is the best place for meeting new talents. Many participants will be experienced developers looking for their next big career move.
sk: Hľadáte programátorov? PyCon je to najlepšie miesto pre stretnutie nových talentov. Mnohí účastníci budú skúsení vývojári, ktorí hľadajú svoj ďalší veľký kariérny krok.

source: Audience
sk: Publikum

source: Want to get your message across to the people, so they talk about you? PyCon is a great opportunity. People in the Python community like to discover and share new things.
sk: Chcete dostať svoje posolstvo medzi ľudí, aby sa o vás hovorilo? PyCon je na to skvelá príležitosť. Ľudia v Python komunite radi objavujú a zdieľajú nové veci.

source: Community
sk: Komunita

source: Looking for new contributors and partners for your open source project? PyCon is the place, where they also will look for you.
sk: Hľadáte nových prispievateľov a partnerov pre váš open source projekt? PyCon je miesto, kde aj oni budú hľadať vás.

source: Support
sk: Podpora

source: Are you using Python in your company? Support for community events is excellent opportunity to contribute back.
sk: Používate vo vašej firme Python? Podpora komunitných udalostí je výborná príležitosť ako prispieť späť.

source: List of talks at PyCon SK 2018
sk: Zoznam prednášok na PyCon SK 2018

source: Financial Aid
sk: Finančná Pomoc

source: Explain why you need financial aid? Be as descriptive as possible...
sk: Vysvetlite, prečo potrebujete finančnú pomoc? Opíšte Vašu situáciu čo možno najviac...

source: Tickets are sold out!
sk: Lístky sú vypredané!

source: You can also buy tickets directly on the %(url)s website in case the tito widget is not displayed correctly.
sk: Vstupenky si taktiež môžete kúpiť priamo na internetovej stránke %(url)s v prípade, že sa Vám Tito widget nezobrazuje správne.

source: Conference tickets are sold out!
sk: Konferenčné lístky sú vypredané!

source: By purchasing a ticket you agree to abide by the <a href="%(url)s">Code of Conduct</a>.
sk: Kúpou lístka vyjadrujete súhlas s dodržiavaním <a href="%(url)s">kódexu správania</a>.

source: Where will the conference happen?
sk: Kde sa uskutoční konferencia?

source: Slovak University of Technology in Bratislava
sk: Slovenská technická univerzita v Bratislave

source: Faculty of Informatics and Information Technologies
sk: Fakulta informatiky a informačných technológií

source: How do you get to Slovak PyCon?
sk: Ako sa dostanete na slovenský PyCon?

source: I don't have PayPal account, is there any other way to buy a ticket?
sk: Nemám PayPal účet, je možné kúpiť vstupenku inak ako cez Tito?

source: If you go to PayPal page there is possibility to pay with credit card (also with debit card) directly, without creating an account.
sk: Na stránke PayPalu je možné uhradiť lístok priamo kreditnou kartou (tiež debetnou kartou), bez nutnosti vytvoriť si účet.

source: We accept wire transfer, since that needs manual work additional 1 Euro fee is applied. Please send us a list of tickets you are interested in, we will send you variable symbol and after we receive the payment, we will issue and send the requested tickets to you by email.
sk: Akceptujeme aj bankový prevod, avšak to si vyžaduje manuálne spracovanie, preto účtujeme 1 Euro poplatok za spracovanie. Napíšte nám, o aké lístky máte záujem, zašleme Vám variabilný symbol a po pripísaní sumy na náš účet Vám vystavíme a pošleme emailom vstupenku.

source: We also accept Bitcoin, Litecoin and (possibly) other crypto currencies. Please send us a list of tickets you are interested in, and currency you want to use and we'll send you a wallet address and once the payment is confirmed, we will issue and send the requested tickets to you by email.
sk: Akceptujeme aj Bitcoin, Litecoin prípadne iné krypto meny. Napíšte nám, o aké lístky máte záujem a menu ktorou chcete platiť. Zašleme Vám adresu penaženky a po potvrdení sumy v nášej peňaženke Vám vystavíme a pošleme emailom vstupenku.

source: Which ticket should I buy?
sk: Aký lístok si mám kúpiť?

source: Real Deal
sk: Reálna cena

source: This is the real price for tickets if it wouldn't be donated by SPy o.z. with sponsors money. Please buy it if you can afford it, your name (company) will be shown on our website.
sk: Skutočná cena lístka, ak by nebol dotovaný SPy o.z. sponzorskými donáciami. Prosím kúpte si tento lístok, ak si ho môžete dovoliť, Vaše meno zobrazíme na stránke.

source: Standard
sk: Štandard

source: This ticket is designed for all conference participants.
sk: Lístok je určený pre všetkých účastníkov konferencie.

source: Teacher
sk: Učiteľ

source: This ticket is designed for teachers. Don't forget to bring your valid teachers ID (ITIC) to the registration.
sk: Lístok je určený pre učiteľov. Nezabudnite si so sebou na registráciu priniesť platný učiteľský preukaz (ITIC).

source: Student
sk: Študent

source: This ticket is designed for students. Don't forget to bring your valid student ID (ISIC) to the registration.
sk: Lístok je určený pre študentov. Nezabudnite si so sebou na registráciu priniesť platný študentský preukaz (ISIC).

source: Where does the money from tickets go?
sk: Kam idú všetky peniaze za lístky?

source: PyCon is completely organized by volunteers. We do believe that such conferences should be organized to promote programming and Open Source. All money collected from the ticket sales will be used to cover the expenses related to organizing the conference.
sk: PyCon je kompletne organizovaný dobrovoľníkmi. Veríme, že organizovať takéto konferencie je potrebné, aby propagovali programovanie a Open Source. Všetky peniaze vyzbierané z predaja lístkov pôjdu na náklady spojené s organizáciou PyConu.

source: <a href="%(url)s">The SPy civic association</a>, as the organizer, commits to transparently disclose all the costs associated with organizing PyCon at the end of the conference. The civic association was created to support Python and programming in general, you can read more about our vision and objectives.
sk: <a href="%(url)s">Občianske združenie SPy</a>, sa ako organizátor, zaväzuje po ukončení konferencie transparentne zverejniť všetky náklady s ňou spojené. SPy vzniklo na podporu Pythonu a programovania všeobecne, prečítajte si viac o našich cieľoch.

source: What do you mean with Real Deal ticket?
sk: Čo myslíte tým "Real Deal" lístok?

source: In order to keep conference accessible for everyone we subsidy all tickets so that most of the people can afford to buy one.
sk: Aby sme udržovali konferenciu dostupnú pre všetkých, dotujeme cenu lístkov natoľko, aby si ich mohla väčšina ľudí dovoliť.

source: Do you offer group discounts?
sk: Ponúkate množstevné zľavy?

source: If you would like to buy more than 15 tickets please contact us by email at info@pycon.sk.
sk: Ak máte záujem kúpiť viac ako 15 lístkov kontaktujete nás emailom na info@pycon.sk.

source: Will there be early bird tickets?
sk: Bude predpredaj lístkov?

source: First 120 tickets will be sold for early bird discount, so hurry up!
sk: Prvých 120 lístkov bude predaných so zľavou, tak neváhajte!

source: Will there be last moment tickets?
sk: Budete predávať aj lístky na poslednú chvíľu?

source: Last 50 tickets will be more expensive, so don't leave your ticket purchase to last moment!
sk: Posledných 50 lístkov bude mať vyššiu cenu, tak si nenechávajte kúpu lístku na poslednú chvíľu!

source: Is there any another possibility to get to PyCon?
sk: Je aj iná možnosť ako sa dostať na PyCon?
