Repository: pyconsk/2018.pycon.sk
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: sk

source: Yes <a href="%(url)s">submit a talk</a>, and if your talk is selected you will receive a speakers ticket for free.
sk: Áno, <a href="%(url)s">navrhnite prednášku</a> a v prípade, že Vás vyberieme obdržíte rečnícky lístok zadarmo.

source: If you are less than 18 years old and come accompanied by a parent, you can just purchase one ticket only for the parent, but you have to inform us in advance to issue an another ticket for the child.
sk: Ak máte menej ako 18 rokov a prídete v sprievode rodiča, stačí ak si lístok zakúpi iba rodič, no musíte sa nám ozvať aby sme vystavili vstupenku aj pre dieťa.

source: Do you have Financial Aid program?
sk: Máte program finančnej podpory?

source: Yes! We have limited amount of tickets for people in need, who would like to join us. If you can't not afford to buy a conference ticket, apply for financial aid and get complimentary conference ticket.
sk: Áno! Máme obmedzené množstvo vstupeniek pre ľudí v núdzi, ktorí by chceli prísť. Ak sa nemôžete dovoliť kúpiť vstupenku na konferenciu, požiadajte o finančnú pomoc a získajte bezplatný lístok na konferenciu.

source: <strong>Third year</strong> will happen <strong>9-11. March, 2018 in Bratislava</strong>.
sk: Hostiteľom jej <strong>tretieho ročníka</strong> bude opäť <strong>Bratislava, 9.-11. Marec 2018</strong>.

source: Venue Address
sk: Adresa konferencie

source: Travelling to Bratislava
sk: Cestovanie do Bratislavy

source: Bratislava is one of the youngest major cities in Europe. Nevertheless, it has a rich history of a free royal coronation town. At that time, it was still called the Pressburg (Prešpork). Today, Bratislava is a major transport hub in Central Europe, and there are plenty of possibilities of getting here.
sk: Bratislava patrí medzi najmladšie hlavné mestá Európy. Napriek tomu má bohatú históriu slobodného kráľovského korunovačného mesta. Vtedy bola ešte nazývaná Prešporkom. Dnes je Bratislava významný dopravný uzol v strednej Európe a možností, ako sa sem dostať, je neúrekom.

source: By air
sk: Letecky

source: If you are travelling to Bratislava, you can fly to the Bratislava airport (airport code: BTS) or the Vienna airport (airport code: VIE). The selection of flights to Vienna is better than to Bratislava.
sk: Ak cestujete do Bratislavy, môžete letieť na bratislavské letisko (kód letiska: BTS) alebo na letisko Viedeň (kód letiska: VIE). Viedenské letisko má v porovnaní s bratislavským podstatne väčší výber letov.

source: There are shuttle buses running between Bratislava and Vienna airport every hour and they are relatively cheap (the bus ride costs about EUR 8 one way, if you book in advance it can got much cheaper). There are three bus companies operating airport shuttles between Vienna airport and Bratislava: SlovakLines (red buses), Blaguss (silver buses) and RegioJet (Yellow busses).
sk: Medzi viedenským letiskom a Bratislavou premáva priame a cenovo dostupné autobusové spojenie každú hodinu - jednosmerná jazda stojí okolo 8 EUR, ak si zakúpite lístok v predstihu môže byť výrazne lacnejší. Autobusovú prepravu prevádzkujú tri spoločnosti: SlovakLines (červené autobusy), Blaguss (strieborné autobusy), RegioJet (žlté autobusy).

source: By car
sk: Autom

source: From Vienna, take highway A4, heading to Schwechat airport, when possible take the exit that leads to highway A6, which heads towards Bratislava.
sk: Z Viedne smerom na letisko Schwechat po diaľnici A4, odbočte na diaľnicu A6, ktorá vedie priamo do Bratislavy.

source: From Budapest, take highway M1 heading to Gyor, follow this route until you see signs for highway M15 headed to Slovakia and Bratislava.
sk: Z Budapešti po diaľnici M1 smerom na Gyor, neskôr odbočte na cestu M15 smerom na Slovensko, do Bratislavy.

source: From Prague, take highway D1 to Brno, once in Brno take highway D2 heading to Slovakia and Bratislava.
sk: Z Prahy po diaľnici D1 do Brna, tam odbočte na D2, ktorá vedie až na Slovensko a pokračujte smerom do Bratislavy.

source: From Warsaw, take highway A1 heading to Katowice. From there follow the road for Čadca, Slovakia. Take this road all the way to Žilina, then switch to highway D1 to Bratislava.
sk: Z Varšavy po diaľnici A1 smerom na Katowice, odtiaľ na Slovensko do Čadce po ceste prvej triedy až do Žiliny. Potom po diaľnici D1 až do Bratislavy.

source: By bus
sk: Autobusom

source: All neighbouring capital cities Vienna, Prague, Budapest, Warsaw and Kiev have direct bus connections.
sk: Všetky okolité hlavné mestá - Viedeň, Praha, Budapešť, Varšava aj Kyjev - majú priame autobusové spojenie do Bratislavy.

source: Once you arrive at the Bratislava bus station (Mlynské Nivy), you'll need to walk through the terminal towards its main entrance. Take a left and walk about 70 meters towards a busy street. Do not cross the street. There will be public transportation bus stops immediately on your right hand side.
sk: Keď vystúpite na autobusovej stanici v Bratislave (Mlynské Nivy), musíte prejsť cez staničnú halu k hlavnému vchodu. Zamierte doľava a po približne 70 metroch sa dostanete k zastávkam mestskej hromadnej dopravy.

source: By train
sk: Vlakom

source: All neighboring capital cities Vienna, Prague, Budapest, Warsaw and Kiev have direct train connections.
sk: Z hlavných miest všetkých susedných krajín, teda z Viedne, Prahy, Budapešti, Varšavy aj Kyjeva, sa priamo do Bratislavy možno dostať aj vlakom.

source: Once you arrive at the Bratislava train station (Bratislava hlavná stanica), you'll need to walk through the terminal towards its main entrance. Directly in front of the main entrance you'll find all your public transportation options on your right hand side.
sk: Po príchode na hlavnú železničnú stanicu v Bratislave prejdite cez staničnú budovu k hlavnému vchodu. Po pravej ruke, približne o 100 metrov nižšie, sa nachádzajú zastávky mestskej hromadnej dopravy.

source: Accommodation
sk: Ubytovanie

source: There are plenty of opportunities for accommodation in Bratislava. From coach surfing, Airbnb to hostels and five star hotels. Even though it is not the main tourist season, we advise you to book your accommodations in advance.
sk: V Bratislave máte široké možnosti ubytovania: od coach surfingu cez Airbnb, hostely až po päťhviezdičkové hotely. Hoci sa konferencia koná mimo hlavnej turistickej sezóny, určite odporúčame zabezpečiť si ubytovanie v predstihu.

source: Guide
sk: Sprievodca

source: Bratislava offers much more than just PyCon. If you decide to stay in Bratislava a few days longer, have a look at <a href="http://mpba.sk/en" title="M_P_ BA: alternative Bratislava map" target="_blank" class="external">M_P_ BA</a> (alternative map of Bratislava) which lists popular attractions as well as unusual destinations within the city. Check out peoples' comments to find out about each location or event.
sk: V Bratislave sa popri konferencii môžete aj zabaviť a získať jedinečné zážitky. Ak sa rozhodnete ostať v Bratislave o niekoľko dní dlhšie, určite si pozrite <a href="http://mpba.sk/sk" title="M_P_ BA: alternatívna mapa Bratislavy" target="_blank" class="external">M_P_ BA</a> (alternatívnu mapu Bratislavy), kde nájdete prehľad obľúbených miest obyvateľov Bratislavy s ich autentickými odporúčaniami a subjektívnymi názormi.

source: Or you can review the <a href="http://www.visitbratislava.com/" title="city pages for visitors" target="_blank" class="external">official city guide for visitors</a>, where you can also find other events that are happening in Bratislava.
sk: Prípadne si môžete pozrieť <a href="http://www.visitbratislava.com/sk" title="stránky mesta pre návštevníkov" target="_blank" class="external">oficiálne stránky mesta, určené pre návštevníkov</a>, kde nájdete aj iné udalosti, ktoré sa práve odohrávajú v Bratislave.
